Revit 2027 API
ViewSheetSetting.Delete Method
Delete the current view sheet set, and make the In-Session set as the current one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Delete()
Public Function Delete As Boolean
public:
bool Delete()
member Delete : unit -> bool
Return Value
Boolean
False if Delete operation fails, otherwise True.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the current view sheet set is In-Session.
Remarks
If the current view sheet set is In-Session, an InvalidOperationException will be thrown.
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace